04_Simulation/2.IN_THE_LOOP/PH_gen100_pop100_symUVK_parIs/running_pfac150_pop100_seed0/run_03404/PH_2D_RANS_kOmegaSSTx/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-3 0 0);

boundaryField
{
    "(inlet|outlet)"
    {
        type            cyclic;
    }

    "(front|back)"
    {
        type            empty;
    }

    "(top|hills)"
    {
		type            fixedValue;
        	value           uniform (0 0 0);
    }
}

// ************************************************************************* //
